package com.example.demo;

import com.github.pagehelper.PageHelper;

public class PageHelperTest {
    public void test(){
/**
 * 给定一个去重过的有序（从小到大）数组和目标值，求出目标值在数组中的索引位置。
 * 如果目标值不存在于数组中，则将目标值插入至数组中（插入仍保证数组有序） 在返回索引位置。
 *
 * 输入、输出举例：
 * 输入：数组为[1,4,5,7]，目标值为5
 * 输出：2
 *
 * 输入：数组为[1,4,5,7]，目标值为2
 * 输出：1
 *
 *
 凑单商品推荐：
 A门店线上商城推出商品满减活动（ 购买商品满100元立减10元） 。当用户选购商品金额不满100元时，弹出推荐凑单商品列表。凑单商品列表展示规则为：
 1.仅推荐单个商品；
 2.推荐商品列表最多只展示10行；
 3.推荐商品按照商品金额由小到大进行排序；

 已知A商城中有N种商品， 当用户选购一个商品p时， 求推荐凑单商品列表是什么？
 要求：
 1. 使用Java实现核心代码
 2. 定义合适对象表示商品列表
 */
    }
}
